In [2]:
import pandas as pd

In [5]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df=pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df.shape

(7, 3)

In [9]:
df.shape[0]

7

In [10]:
df.shape[1]

3

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [12]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [13]:
df.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [14]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [15]:
df.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [16]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [20]:
df['Gender'].nunique()

2

In [21]:
df['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [23]:
df[(df['Marks']>=90) & (df['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [25]:
sum(df['Marks'].between(90,100))

4

In [27]:
df['Marks'].mean()

92.14285714285714

In [28]:
df['Marks'].min()

83

In [29]:
df['Marks'].max()

99

In [34]:
def marks(x):
    return x//2

In [35]:
df['Half-Marks']=df['Marks'].apply(marks)

In [36]:
df

      Name  Marks  Gender  Half-Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [39]:
df['Half-Marks']=df['Marks'].apply(lambda x:x//2)

In [40]:
df

      Name  Marks  Gender  Half-Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [41]:
df['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [42]:
df

      Name  Marks  Gender  Half-Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [43]:
df['Encoded']=df['Gender'].map({'Male':1,'Female':0})

In [44]:
df

      Name  Marks  Gender  Half-Marks  Encoded
0  Priyang     98    Male          49        1
1   Aadhya     89  Female          44        0
2   Krisha     99  Female          49        0
3   Vedant     87    Male          43        1
4   Parshv     90    Male          45        1
5   Mittal     83  Female          41        0
6  Archana     99  Female          49        0

In [45]:
df.drop('Encoded',axis=1)

      Name  Marks  Gender  Half-Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [46]:
df.drop(['Half-Marks','Encoded'],axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [47]:
df.drop(['Half-Marks','Encoded'],axis=1,inplace=True)

In [48]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [49]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [51]:
df.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [54]:
df[df['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [55]:
df[df['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99